app/channels/room_channel.rb

  def speak(data)
    Message.create!(content: data['message'])
---
INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "こんにちは"], ["created_at", "2020-01-26 11:52:43.780459"], ["updated_at", "2020-01-26 11:52:43.780459"]]