app/controllers/chats_controller.rb

SELECT  "messages".* FROM "messages" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def show
    @messages = Message.all.page(params[:page]).per(PER).reverse_order