app/controllers/houses_controller.rb

INSERT INTO "houses" ("title", "address", "deposit", "key", "comment", "body", "prefecture", "price", "construction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @house = House.new(house_params)
    @house.user_id = current_user.id
    @user = current_user
    if @house.save