app/controllers/houses_controller.rb

INSERT INTO "houses" ("title", "house_image_id", "address", "deposit", "key", "comment", "body", "user_id", "prefecture", "price", "construction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @house = House.new(house_params)
    @house.user_id = current_user.id
    @user = current_user
    if @house.save

UPDATE "houses" SET "house_image_id" = ?, "status" = ?, "updated_at" = ? WHERE "houses"."id" = ?  [["house_image_id", "3cb4c01dbfb4df88a6a30e1979064f85ea002adef73708f8e128f54cb5d5"], ["status", 1], ["updated_at", "2020-01-19 17:17:22.115915"], ["id", 2]]
---
  def update
    @house = House.find(params[:id])
    if @house.update(house_params)

DELETE FROM "houses" WHERE "houses"."id" = ?  [["id", 2]]
---
  def destroy
    @house = House.find(params[:id])
    @house.destroy