app/controllers/rooms_controller.rb

  def index
    @users = User.all
    # @users = User.curret_user.matching
    @rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

  def create
    if Room.between(params[:to_id], params[:from_id]).present?
      @room = Room.between(params[:to_id], params[:from_id]).first
    else
      @room = Room.create!(room_params)
---
SELECT  1 AS one FROM "rooms" WHERE "rooms"."to_id" = ? AND "rooms"."from_id" = ? LIMIT ?  [["to_id", 1], ["from_id", 3], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE ((rooms.to_id = '1' AND rooms.from_id = '3') OR (rooms.to_id = '3' AND rooms.from_id ='1'))
SELECT  "rooms".* FROM "rooms" WHERE ((rooms.to_id = '1' AND rooms.from_id = '3') OR (rooms.to_id = '3' AND rooms.from_id ='1')) ORDER BY "rooms"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "rooms" ("to_id", "from_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["to_id", 1], ["from_id", 3], ["created_at", "2020-01-27 17:31:46.676313"], ["updated_at", "2020-01-27 17:31:46.676313"]]