app/controllers/talks_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
class TalksController < ApplicationController
  before_action :authenticate_user!
  before_action do
    @room = Room.find(params[:room_id])

SELECT "talks".* FROM "talks" WHERE "talks"."room_id" = ?  [["room_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @talks = @room.talks

    if @room.to_id == current_user.id
      @user = User.find(@room.from_id)
    elsif @room.from_id == current_user.id
      @user = User.find(@room.to_id)
    end

    if @talks.length > 10

INSERT INTO "talks" ("conversation", "room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["conversation", "こんばんわ"], ["room_id", 1], ["user_id", 3], ["created_at", "2020-01-27 18:14:04.690141"], ["updated_at", "2020-01-27 18:14:04.690141"]]
---
  def create
    @talk = @room.talks.build(talk_params)
    if @talk.save