app/controllers/users_controller.rb

  def confirm
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "user_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_image_id", "f563feac13c5b4a093364deb065f13c510d01ceb444744cd9a1f9593174b"], ["updated_at", "2020-01-19 16:59:03.294609"], ["id", 1]]