app/models/user.rb

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ? AND "users"."id" = ? LIMIT ?  [["follower_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]
---
  def followers?(other_user)
    followers.include?(other_user)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]
---
  def unfollow(other_user)
    active_relationships.find_by(followed_id: other_user.id).destroy